#include <stdio.h>

//!!!!!!sizeof是操作符!!!!!而且是单目操作符,只有一个操作数

// 操作符
//  算数操作符  加减乘除模
//             + _ * / %
//  移位操作符
//             >>   <<
//  位操作符
//             &  ^  |
//  赋值操作符
//             =
//             += -= *= /=   没有&=???
//             &= ^= |=
//             >>= <<=


//  单目操作符
//             !  - + & sizeof ~ -- ++ * (类型)

//  关系操作符  > >= < <= != ==

//逻辑操作符
//             &&  ||

//条件操作符(三目操作符) 
//             X1X?X2X:X3X   如果X1X真,则整个式子值为X2X,否则式子值为X3X

//逗号表达式  就是逗号隔开的一串表达式,从左到右依次运行表达式,然后整个表达式的结果等于最后一个表达式的结果
//             XX,XX,XX,XX,XX

//下表引用,等操作符
//             [](双目操作符) ()(函数调用操作符,括号内的数和函数名都是他的操作数)  .  ->  * 

int main()
{
    printf("7/2=%f\n", 7 / 2);     // 输出为0.000000
    printf("7/2.0=%f\n", 7.0 / 2); // 输出为3.500000

    //! 就是把非零的值变成零;把零变成非零的值(这个变多少有规定吗?)gcc编译器测试,对0进行!运算,只能变成非零中的1这种情况
    int a = 0;
    double arr[][5] = {0,0,0,0,0,0};
    if (-5)
    {
        printf("%d\n", !a);
    }

    int b = 20;
    int r = a > b ? 99 : 20;
    printf("%d\n", r);

    //不是函数,所以可以不要括号
    printf("%d\n", sizeof(a));
    printf("%d\n", sizeof(int));//必须要括号
    printf("%d\n", sizeof a);
    printf("%d\n", sizeof arr);

    return 0;
}